## Plan Result (sds_prod_ado)




<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.aks_mi_apintegration_contributor[0]
  * azurerm_role_assignment.aks_mi_datasharelanding_contributor[0]
  * azurerm_role_assignment.mi_adhoc_contributor[0]
  * azurerm_role_assignment.mi_audit_contributor[0]
  * azurerm_role_assignment.mi_export_contributor[0]
  * azurerm_role_assignment.mi_landing_contributor[0]
  * azurerm_role_assignment.mi_pds_contributor[0]
  * azurerm_role_assignment.mi_polybasestaging_contributor[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.aks_mi_apintegration_contributor[0] will be created
  + resource "azurerm_role_assignment" "aks_mi_apintegration_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-prod-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.Storage/storageAccounts/miapintegrationprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.aks_mi_datasharelanding_contributor[0] will be created
  + resource "azurerm_role_assignment" "aks_mi_datasharelanding_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-prod-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.Storage/storageAccounts/midatasharelandingprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_adhoc_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_adhoc_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-prod-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.Storage/storageAccounts/miadhoclandingprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_audit_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_audit_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-prod-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.Storage/storageAccounts/miauditprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_export_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_export_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-prod-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.Storage/storageAccounts/miexportprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_landing_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_landing_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-prod-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.Storage/storageAccounts/milandingprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_pds_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_pds_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-prod-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.Storage/storageAccounts/mipersistentprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.mi_polybasestaging_contributor[0] will be created
  + resource "azurerm_role_assignment" "mi_polybasestaging_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "azure-devops-prod-mi"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/mi-prod-rg/providers/Microsoft.Storage/storageAccounts/mipolybasestagingprod"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":3,"Program":"tfcmt","SHA1":"","Target":"sds_prod_ado","Vars":{}} -->